hamish-milne/ch32fun_ch582_ledbadge/ledbadge2.c


#include "ch32fun.h"

#define MATRIX_NROW        11
#define MATRIX_NCOL        44
#define FB_NCOL            (MATRIX_NCOL /2) // number of columns in framebuffer

#define PIN_CHARGE_STT     PA0
#define PIN_CHARGE_STT_INT PIN_CHARGE_STT
#define PIN_KEY1           PA1
#define PIN_KEY1_INT       PIN_KEY1
#define PIN_KEY2           PB22
#define PIN_KEY2_INT       PB8 // ch582 is weird, PB22 interrupt comes in on PB8 bit in irq flag
#define PIN_VBAT_ADC       PA5

// For now copied from ch32fun.LowPowerSleep, since we don't want the RTCTrigger() call in there.
RV_STATIC_INLINE void BigSleep(uint16_t power_plan) 
{
#if defined(CH570_CH572) && (FUNCONF_POWERED_BY_V5PIN == 1)
	power_plan |= RB_PWR_LDO5V_EN;
#endif

#ifdef CH570_CH572
#if ( CLK_SOURCE_CH5XX == CLK_SOURCE_PLL_75MHz ) || ( CLK_SOURCE_CH5XX == CLK_SOURCE_PLL_100MHz )
	//if system clock is higher than 60Mhz, it need to be reduced before sleep.
	SYS_SAFE_ACCESS
	(
		R8_CLK_SYS_CFG = CLK_SOURCE_PLL_60MHz;
	);
#endif
#else
	SYS_SAFE_ACCESS
	(
		R8_BAT_DET_CTRL = 0;
		R8_XT32K_TUNE = (R16_RTC_CNT_32K > 0x3fff) ? (R8_XT32K_TUNE & 0xfc) | 0x01 : R8_XT32K_TUNE;
		R8_XT32M_TUNE = (R8_XT32M_TUNE & 0xfc) | 0x03;
	);
#endif

	NVIC->SCTLR |= (1 << 2); //deep sleep
	SYS_SAFE_ACCESS
	(
		R8_SLP_POWER_CTRL |= RB_RAM_RET_LV;
		R16_POWER_PLAN = RB_PWR_PLAN_EN | RB_PWR_CORE | power_plan;
		R8_PLL_CONFIG |= (1 << 5);
	);
	
	NVIC->SCTLR &= ~(1 << 3); // wfi
	asm volatile ("wfi\nnop\nnop" );

#ifdef CH570_CH572
#if ( CLK_SOURCE_CH5XX == CLK_SOURCE_PLL_75MHz ) || ( CLK_SOURCE_CH5XX == CLK_SOURCE_PLL_100MHz )
	//machine delay for a while.
	uint16_t i = 400;
	do {
		asm volatile("nop");
	} while(i--);

	//get system clock back to normal
	SYS_SAFE_ACCESS
	(
		R8_CLK_SYS_CFG = CLK_SOURCE_CH5XX;
	);
#endif
#else
	SYS_SAFE_ACCESS
	(
		R16_POWER_PLAN &= ~RB_XT_PRE_EN;
		R8_PLL_CONFIG &= ~(1 << 5);
		R8_XT32M_TUNE = (R8_XT32M_TUNE & 0xfc) | 0x01;
	);
#endif
}

#pragma region Layers

// These are the events that layers can respond to
typedef enum {
    EVENTS_NONE = 0,
    EVENTS_KEY1 = 1 << 0,
    EVENTS_KEY2 = 1 << 1,
    EVENTS_RTC = 1 << 2,
    EVENTS_CHARGE = 1 << 3,
    EVENTS_RESET = 1 << 4,
} events_t;

static events_t g_events = EVENTS_NONE;

// These flags allow layer code to request peripherals to be enabled
typedef enum {
    ACTIVE_NONE = 0,
    ACTIVE_SCREEN = 1 << 1,
    ACTIVE_BLE = 1 << 2,
    ACTIVE_USB = 1 << 3,
} active_t;

// These are flags set by layers to indicate actions they have taken
typedef enum {
    // If set, a frame is being prepared for drawing, and we should set DRAW_READY when done.
    LF_DRAWING = (1 << 0),
} layer_flags_t;

typedef struct {
    events_t events;
    active_t active;
    layer_flags_t flags;
} layer_result_t;
#define WAIT_IDLE 0

typedef void (*layer_t)(layer_result_t *state, void *self, int next);

#define MAX_LAYERS 10
static layer_t g_layers[MAX_LAYERS] = {NULL};

static void push_layer(layer_t layer) {
    for (int i = 0; i < MAX_LAYERS; i++) {
        if (!g_layers[i]) {
            g_layers[i] = layer;
            break;
        }
    }
}

static void pop_layer() {
    for (int i = MAX_LAYERS-1; i>=0; --i) {
        if (g_layers[i]) {
            g_layers[i] = NULL;
            break;
        }
    }
}

static void layer_next(layer_result_t *state, int next) {
    if (next < MAX_LAYERS && g_layers[next]) {
        g_layers[next](state, &g_layers[next], next + 1);
    }
}

static layer_result_t run_layers(events_t events) {
    layer_result_t state = { events, 0, 0 };
    layer_next(&state, 0);
    return state;
}

#pragma endregion

#pragma region Screen

#define LINE_A PA15
#define LINE_B PB18
#define LINE_C PB0
#define LINE_D PB7
#define LINE_E PA12
#define LINE_F PA10
#define LINE_G PA11
#define LINE_H PB9
#define LINE_I PB8
#define LINE_J PB15
#define LINE_K PB14
#define LINE_L PB13
#define LINE_M PB12
#define LINE_N PB5
#define LINE_O PA4
#define LINE_P PB3
#define LINE_Q PB4
#define LINE_R PB2
#define LINE_S PB1
#define LINE_T PB6 // or PB23
#define LINE_U PB21
#define LINE_V PB20
#define LINE_W PB19

static u32 led_lines[] = {
	LINE_A, LINE_B, LINE_C, LINE_D, LINE_E,
	LINE_F, LINE_G, LINE_H, LINE_I, LINE_J,
	LINE_K, LINE_L, LINE_M, LINE_N, LINE_O,
	LINE_P, LINE_Q, LINE_R, LINE_S, LINE_T,
	LINE_U, LINE_V, LINE_W
};
#define NLINES (sizeof(led_lines) / sizeof(u32))

typedef uint16_t framebuffer_t[MATRIX_NCOL];

typedef struct {
	uint32_t pa_mode;
	uint32_t pa_val;
	uint32_t pb_mode;
	uint32_t pb_val;
	int on_count;
} chunk_t;

__HIGH_CODE
static chunk_t pack_fb_row(framebuffer_t fb, int chunk) {
    uint16_t a = fb[chunk*2];
    uint16_t b = fb[chunk*2 + 1];
    if (chunk == 0) {
        // Swap first 2 pixels of the first row
        uint16_t a0 = a;
        a = (a & 0xfffe) | (b & 1);
        b = (b & 0xfffe) | (a0 & 1);
    }
    
    uint32_t pa = 0;
    uint32_t pb = 0;
	uint32_t pa_val = 0;
	uint32_t pb_val = 0;
    int on_count = 0;
    for (int i = 0, j = 0; i < NLINES; i++, j++) {
        uint32_t line = led_lines[i];
        int value;
        if (i == chunk) {
            // Row line; always lit
            value = 1;
			// Also push 5v
			if (line & PB) {
				pb_val |= line;
			} else {
				pa_val |= line;
			}
            // The row can't also be a column, so we skip this index
            j--;
        } else {
            value = ((j % 2 ? b : a) >> (j / 2)) & 1;
            on_count += value;
        }
        if (value) {
            if (line & PB) {
                pb |= line;
            } else {
                pa |= line;
            }
        }
    }
    chunk_t ret = { pa, pa_val, pb & ~PB, pb_val & ~PB, on_count };
	return ret;
}

typedef enum {
    // Which framebuffer is currently being drawn
    DRAW_FB = (1 << 0),
    // If set, the framebuffer is ready to be swapped in at the next opportunity
    DRAW_READY = (1 << 1),
    // If set, a draw has completed and a new framebuffer can be prepared
    DRAW_COMPLETE = (1 << 2),
} draw_state_t;

typedef enum {
    // If set, variable refresh rate is enabled. This will skip columns with no lit pixels,
    // improving brightness for low-duty-cycle content.
    SCREEN_VRR = (1 << 0),
} screen_flags_t;

typedef struct {
    framebuffer_t fb;
    uint32_t tmr_period;
    screen_flags_t flags;
    uint8_t brightness;
} frame_data_t;

#define RR_DIV 8

static frame_data_t frame_data[2] = {0};
static volatile draw_state_t draw_state = 0;

static int _fb_idx = 0;
static chunk_t _fb_prev = {};
static int _fb_wait = 0;
static int _fb_lit_cols = 0;

static inline uint32_t RefreshRateHz(int freq) {
    return FUNCONF_SYSTEM_CORE_CLOCK / (RR_DIV * FB_NCOL * freq);
}

static framebuffer_t * DrawFrame(layer_result_t *state, int freq, uint8_t brightness, screen_flags_t flags) {
    state->active |= ACTIVE_SCREEN;
    if (brightness > RR_DIV-1) {
        brightness = RR_DIV-1;
    }
    draw_state_t ds = draw_state;
    if (ds & DRAW_COMPLETE) {
        draw_state = ds & ~DRAW_COMPLETE;
        frame_data_t *fd = &frame_data[~ds & DRAW_FB];
        fd->tmr_period = RefreshRateHz(freq);
        fd->brightness = brightness;
        fd->flags = flags;
        state->flags |= LF_DRAWING;
        return &fd->fb;
    }
    return NULL;
}

static uint32_t lag_frames = 0;

__INTERRUPT
__HIGH_CODE
void TMR0_IRQHandler() {
	R8_TMR0_INT_FLAG = R8_TMR0_INT_FLAG; // acknowledge
    // Suspend interrupts to avoid glitches during button presses
    uint32_t irqs = NVIC_get_enabled_IRQs();
    NVIC_clear_all_IRQs_except(0);

    frame_data_t *fd = &frame_data[draw_state & DRAW_FB];

    if (_fb_wait == fd->brightness) {
        R32_PA_OUT &= ~_fb_prev.pa_val;
        R32_PB_OUT &= ~_fb_prev.pb_val;
        R32_PA_DIR &= ~_fb_prev.pa_mode;
        R32_PB_DIR &= ~_fb_prev.pb_mode;

        if (_fb_idx == 0 && _fb_lit_cols >= FB_NCOL) {
            _fb_lit_cols -= FB_NCOL;
            draw_state_t state = draw_state;
            // If the _READY bit is set, swap framebuffers
            if (state & DRAW_READY) {
                draw_state = DRAW_COMPLETE | (~DRAW_READY & (state ^ DRAW_FB));
                uint32_t new_period = frame_data[~state & DRAW_FB].tmr_period;
                if (new_period) {
                    R32_TMR0_CNT_END = new_period;
                } else {
                    R8_TMR0_CTRL_MOD = 0;
                    NVIC_restore_IRQs(irqs);
                    return;
                }
            } else {
                draw_state = DRAW_COMPLETE | state;
                lag_frames++;
            }
        }
    }

    if (_fb_wait == 0) {
        chunk_t chunk;
        screen_flags_t has_vrr = fd->flags & SCREEN_VRR;
        do {
            chunk = pack_fb_row(fd->fb, _fb_idx);
            _fb_idx = (_fb_idx + 1) % FB_NCOL;
        } while (has_vrr && chunk.on_count == 0 && _fb_idx != 0);
        R32_PA_DIR |= chunk.pa_mode;
        R32_PB_DIR |= chunk.pb_mode;
        R32_PA_OUT |= chunk.pa_val;
        R32_PB_OUT |= chunk.pb_val;
        _fb_wait = RR_DIV - 1;
        _fb_lit_cols++;
        _fb_prev = chunk;
    } else {
        _fb_wait--;
    }
    NVIC_restore_IRQs(irqs);
}

static void ScreenLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_RESET) {
        R32_TMR0_CNT_END = RefreshRateHz(50); // default 50Hz
        R8_TMR0_INTER_EN = RB_TMR_IE_CYC_END;
        NVIC_EnableIRQ(TMR0_IRQn);
    }
    layer_next(state, next);
    if (state->flags & LF_DRAWING) {
        draw_state |= DRAW_READY;
    }
    if (state->active & ACTIVE_SCREEN) {
        R8_TMR0_CTRL_MOD = RB_TMR_COUNT_EN;
    } else {
        frame_data[~draw_state & DRAW_FB].tmr_period = 0;
    }
}

#pragma endregion

#pragma region Buttons

void GPIOSetup() {
	funPinMode( PIN_KEY1, GPIO_CFGLR_IN_PD ); // Set PIN_KEY1 to input, pulldown as keypress is to vcc
	funPinMode( PIN_KEY2, GPIO_CFGLR_IN_PU ); // Set PIN_KEY2 to input, pullup as keypress is to gnd
	funPinMode( PIN_CHARGE_STT, GPIO_CFGLR_IN_PU ); // Set PIN_CHARGE_STT to input, pullup as connecting charger makes this go to gnd
	funPinMode( PIN_VBAT_ADC, GPIO_CFGLR_IN_FLOAT ); // Set PIN_VBAT_ADC to floating input for ADC

	// key1 and charge stt interrupts
	R16_PA_INT_MODE |= (PIN_KEY1_INT | PIN_CHARGE_STT_INT); // edge mode, should go to ch32fun.h
	funDigitalWrite(PIN_KEY1, FUN_HIGH); // rising edge
	funDigitalWrite(PIN_CHARGE_STT, FUN_LOW); // falling edge

	NVIC_EnableIRQ(GPIOA_IRQn);
	R16_PA_INT_IF = (PIN_KEY1_INT | PIN_CHARGE_STT_INT); // reset key1 and charge stt flags
	R16_PA_INT_EN |= (PIN_KEY1_INT | PIN_CHARGE_STT_INT); // enable key1 and charge stt interrupts

	// key2 interrupt
	R16_PIN_ALTERNATE |= RB_PIN_INTX; // set PB8 interrupt to PB22 (PIN_KEY2_INT points to PB8)
	R16_PB_INT_MODE |= (PIN_KEY2_INT & ~PB); // edge mode, should go to ch32fun.h
	funDigitalWrite(PIN_KEY2, FUN_LOW); // falling edge

	NVIC_EnableIRQ(GPIOB_IRQn);
	R16_PB_INT_IF = (PIN_KEY2_INT & ~PB); // reset key2 flag
	R16_PB_INT_EN |= (PIN_KEY2_INT & ~PB); // enable key2 interrupt

	// enable wakeup on either key
	SYS_SAFE_ACCESS(
		R8_SLP_WAKE_CTRL |= (RB_WAKE_EV_MODE | RB_SLP_GPIO_WAKE);
		R8_SLP_POWER_CTRL &= ~(RB_WAKE_DLY_MOD);
		R8_SLP_POWER_CTRL |= 0x00; // 0x00: long delay, 0x01: short delay (short doesn't work here)
	);
}

__INTERRUPT
void GPIOA_IRQHandler() {
	int status = R16_PA_INT_IF;
	R16_PA_INT_IF = status; // acknowledge

	if(status & PIN_KEY1_INT) {
        g_events |= EVENTS_KEY1;
	}
	if(status & PIN_CHARGE_STT_INT) {
        g_events |= EVENTS_CHARGE;
	}
}

__INTERRUPT
void GPIOB_IRQHandler() {
	int status = R16_PB_INT_IF;
	R16_PB_INT_IF = status; // acknowledge

	if(status & PIN_KEY2_INT) {
        g_events |= EVENTS_KEY2;
	}
}

static void ButtonsLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_RESET) {
        GPIOSetup();
    } else {
        state->events |= g_events;
        g_events = 0;
    }
    layer_next(state, next);
}

#pragma endregion

#pragma region Game-of-life

static void gol(framebuffer_t active_fb) {
    framebuffer_t fb2 = {0};
    for (int x = 0; x < MATRIX_NCOL; x++) {
        for (int y = 0; y < MATRIX_NROW; y++) {
            int ncount = 0;
            for (int xa=-1; xa<=1; xa++) {
                for (int ya=-1; ya<=1; ya++) {
                    if (active_fb[(x + xa + MATRIX_NCOL) % MATRIX_NCOL] & (1 << ((y + ya + MATRIX_NROW) % MATRIX_NROW))) {
                        ncount++;
                    }
                }
            }
            if (ncount == 3) {
                fb2[x] |= 1<<y;
            } else if (ncount == 4) {
                fb2[x] |= active_fb[x] & (1<<y);
            }
        }
    }
    memcpy(active_fb, fb2, sizeof(fb2));
}

/* White Noise Generator State */
#define NOISE_BITS 8
#define NOISE_MASK ((1<<NOISE_BITS)-1)
#define NOISE_POLY_TAP0 31
#define NOISE_POLY_TAP1 21
#define NOISE_POLY_TAP2 1
#define NOISE_POLY_TAP3 0
uint32_t lfsr = 1;

/*
 * random byte generator
 */
uint8_t rand8(void)
{
    uint8_t bit;
    uint32_t new_data;

    for(bit=0;bit<NOISE_BITS;bit++)
    {
        new_data = ((lfsr>>NOISE_POLY_TAP0) ^
                    (lfsr>>NOISE_POLY_TAP1) ^
                    (lfsr>>NOISE_POLY_TAP2) ^
                    (lfsr>>NOISE_POLY_TAP3));
        lfsr = (lfsr<<1) | (new_data&1);
    }

    return lfsr&NOISE_MASK;
}

static void gol_rand(framebuffer_t active_fb) {
    lfsr = R32_RTC_CNT_32K;
	for (int i = 0; i < MATRIX_NCOL; i++) {
		active_fb[i] = rand8() | (rand8()<<8);
	}
}

static framebuffer_t gol_fb;

static void GolLayer(layer_result_t *state, void *self, int next) {
    // If KEY1 is pressed this loop...
    if (state->events & EVENTS_RESET) {
        // Initialize the board
        gol_rand(gol_fb);
    }
    framebuffer_t * active_fb = DrawFrame(state, 50, 0, SCREEN_VRR);
    if (active_fb) {
        // Run an iteration of the game
        gol(gol_fb);
        memcpy(*active_fb, gol_fb, sizeof(gol_fb));
    }
    // Allow layers later in the stack to make their own changes
    layer_next(state, next);
}

#pragma endregion

#pragma region Bounce

static uint32_t bounce_time = 0;
static int bounce_x = MATRIX_NCOL/2;
static int bounce_y = MATRIX_NROW/2;
static int bounce_dir = 0;

#define BALL_H 5
#define BALL_W 5

static int bounce_toggle = 1;

static void BounceLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_KEY2) {
        bounce_toggle = !bounce_toggle;
    }
    framebuffer_t * active_fb = DrawFrame(state, 30, 0, bounce_toggle ? SCREEN_VRR : 0);
    if (active_fb) {
        bounce_x += (bounce_dir & 1) ? 1 : -1;
        bounce_y += (bounce_dir & 2) ? 1 : -1;
        if (bounce_x <= BALL_W/2 || bounce_x >= MATRIX_NCOL-(BALL_W/2)-1) {
            bounce_dir ^= 1;
        }
        if (bounce_y <= BALL_H/2 || bounce_y >= MATRIX_NROW-(BALL_H/2)-1) {
            bounce_dir ^= 2;
        }
        memset(*active_fb, 0, sizeof(*active_fb));
        uint16_t v = ((1 << BALL_H)-1) << (bounce_y - (BALL_H/2));
        for (int i = -BALL_W/2; i < (BALL_W/2)+1; i++) {
            int x = bounce_x + i;
            if (x < 0 || x >= MATRIX_NCOL) {
                continue;
            }
            (*active_fb)[x] = v;
        }
    }
    layer_next(state, next);
}

#pragma endregion

#pragma region Bad Apple

extern const char badapple[];
extern const int badapple_size;

static int badapple_frame;
static uint32_t badapple_time = 0;

#define VID_FRAME_SIZE  (FB_NCOL * 3)

static void BadappleLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_RESET) {
        badapple_frame = 0;
    }
    framebuffer_t * active_fb = DrawFrame(state, 60, 0, 0);
    if (active_fb) {
        badapple_time++;
        if (badapple_time >= 2) {
            badapple_time = 0;
            for (int i = 0; i < FB_NCOL; i++) {
                int chunk_start = badapple_frame + i*3;
                uint32_t b0 = badapple[chunk_start];
                uint16_t b1 = badapple[chunk_start + 1];
                uint16_t b2 = badapple[chunk_start + 2];
                int chunk = i*2;
                (*active_fb)[chunk] = b0 | (b1 << 8);
                (*active_fb)[chunk + 1] = ((b1>>3) & 0b11111) | (b2 << 5);
            }
            badapple_frame = (badapple_frame + VID_FRAME_SIZE) % badapple_size;
        } else {
            // Use the previous frame again
            state->flags &= ~LF_DRAWING;
        }
    }
    layer_next(state, next);
}

#pragma endregion

static void BtlLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_KEY2 && funDigitalRead(PIN_KEY1)) {
        DCDCEnable(); // this seems to be needed!?
        jump_isprom();
    }
    layer_next(state, next);
}

static layer_t ctrl_layers[] = {
    &GolLayer,
    &BounceLayer,
    &BadappleLayer,
    NULL,
};
#define CTRL_LAYERS_COUNT  (sizeof(ctrl_layers)/sizeof(layer_t));
static int ctrl_layer_idx = 0;

static void CtrlLayer(layer_result_t *state, void *self, int next) {
    if (state->events & EVENTS_KEY1) {
        ctrl_layer_idx = (ctrl_layer_idx + 1) % CTRL_LAYERS_COUNT;
        state->events |= EVENTS_RESET;
    }
    g_layers[next] = ctrl_layers[ctrl_layer_idx];
    layer_next(state, next);
}

int main() {
    SystemInit();
    push_layer(&ButtonsLayer);
    push_layer(&ScreenLayer);
    push_layer(&BtlLayer);
    push_layer(&CtrlLayer);

    run_layers(EVENTS_RESET);
    while (1) {
        layer_result_t state = run_layers(EVENTS_NONE);
        if (state.active) {
            __WFI();
        } else {
            BigSleep(RB_PWR_RAM2K); // TODO: determine a good power plan here - what RAM do we keep, if any?
            DCDCEnable();
            run_layers(EVENTS_RESET);
        }
    }
}
